In [4]:
import pandas as pd

In [2]:
# 简单来说，DataFrame 是多个 共用相同索引 的Series组成
# Series 没有列索引，DataFrame有列索引

In [8]:
data = {
    'name': ['lemon', 'Jack', 'Jason'],
    'age': [20,25,27],
    'sex': ['male', 'female', 'male']
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

    name  age     sex
0  lemon   20    male
1   Jack   25  female
2  Jason   27    male

# 1.DataFrame 可拆分成多个Series

In [11]:
df['name']

0    lemon
1     Jack
2    Jason
Name: name, dtype: object

In [12]:
type(df['name'])

pandas.core.series.Series

In [13]:
name = df['name']

In [14]:
name

0    lemon
1     Jack
2    Jason
Name: name, dtype: object

In [18]:
df

    name  age     sex
0  lemon   20    male
1   Jack   25  female
2  Jason   27    male

In [16]:
age = df['age']

In [17]:
age

0    20
1    25
2    27
Name: age, dtype: int64

# 2.多个Series，也可组合成 DataFrame

In [19]:
name

0    lemon
1     Jack
2    Jason
Name: name, dtype: object

In [20]:
age

0    20
1    25
2    27
Name: age, dtype: int64

In [22]:
df

    name  age     sex
0  lemon   20    male
1   Jack   25  female
2  Jason   27    male

In [23]:
pd.DataFrame([name,age]).T

    name age
0  lemon  20
1   Jack  25
2  Jason  27

In [12]:
# .T 可转置

In [14]:
# 其他操作：逐行读取数据

In [24]:
df

    name  age     sex
0  lemon   20    male
1   Jack   25  female
2  Jason   27    male

In [26]:
for index,value in df.iterrows():
    name,age,sex = value
    
    print(age)
    print(sex)

20
male
25
female
27
male